library(dplyr)
library(psych)
library(car)
library(ggplot2)
library(vcd)
library(plyr)

rm(list=ls())
ls()

setwd("C:/Users/Acorn2/Desktop/R프로젝트")
mmd<-read.csv("modifiedMd2.csv")
na.rm=TRUE

# 나이대별 디지털정보화 수준 => 아노바
mmd$X.일반.장노년.연령 <-recode(mmd$X.일반.장노년.연령,"lo:19='10대';20:29='20대';30:39='30대';40:49='40대';50:59='50대';60:hi='60이상'")

mmd$X.일반.장노년.연령<-recode(mmd$X.일반.장노년.연령, "lo:19='10대'; 20:29='20대'; 30:39='30대'; 40:49='40대'; 50:59='50대'; 60:hi='60대이상'")
mmd$AgeRe<-as.factor(mmd$AgeRe)

mode(mmd$AgeRe)



describeBy(mmd$디지털정보화수준, mmd$AgeRe,  mat=T) #mat=T: matching을 한다.

mmd$AgeRe[mmd$X.일반.장노년.연령>=0&mmd$X.일반.장노년.연령<=19]<-"10대"
mmd$AgeRe[mmd$X.일반.장노년.연령>=20&mmd$X.일반.장노년.연령<=29]<-"20대"
mmd$AgeRe[mmd$X.일반.장노년.연령>=30&mmd$X.일반.장노년.연령<=39]<-"30대"
mmd$AgeRe[mmd$X.일반.장노년.연령>=40&mmd$X.일반.장노년.연령<=49]<-"40대"
mmd$AgeRe[mmd$X.일반.장노년.연령>=50&mmd$X.일반.장노년.연령<=59]<-"50대"
mmd$AgeRe[mmd$X.일반.장노년.연령>=60&mmd$X.일반.장노년.연령<=69]<-"60대"
mmd$AgeRe[mmd$X.일반.장노년.연령>=70]<-"70대이상"

#X 학력, 성별, 연령, 직업, 소득, 지역이 디지털정보화 수준에 영향을 미치는지 => 선형회귀

digitalIndex.glm<-glm(디지털정보화수준~더미초졸+더미중졸+더미고졸+더미대졸
                            +소득더미100미만+소득더미100+소득더미200+소득더미300+소득더미400+소득더미500+소득더미600
                            , data=mmd)
summary(digitalIndex.glm)

# 상관관계
install.packages("corrplot")
library(corrplot)
mmd$X.일반.장노년.가구.월평균.소득<-ifelse(mmd$X.일반.장노년.가구.월평균.소득==99, NA, mmd$X.일반.장노년.가구.월평균.소득)

Reg<-data.frame(mmd$디지털정보화수준, mmd$X.일반.장노년.연령, mmd$X.일반.장노년.최종학력, mmd$X.일반.장노년.가구.월평균.소득, as.numeric(mmd$X.일반.장노년.현재.거주지역..광역시도.))

str(mmd$X.일반.장노년.최종학력)
Reg2<-na.omit(Reg)

Reg2<-rename(Reg2, "디지털정보화수준"="mmd.디지털정보화수준")
Reg2<-rename(Reg2, "월평균소득"="mmd.X.일반.장노년.가구.월평균.소득")
Reg2<-rename(Reg2, "연령"="mmd.X.일반.장노년.연령")
Reg2<-rename(Reg2, "학력"="mmd.X.일반.장노년.최종학력")
Reg2<-rename(Reg2, "지역"="as.numeric.mmd.X.일반.장노년.현재.거주지역..광역시도..")


library(dplyr)

digit.cor<-cor(Reg2)
digit.cor

corrplot(digit.cor, method="shade", addshade="all", shade.col=FALSE,
         tl.col="red", tl.srt=30, diag=FALSE, addCoef.col="white", order="FPC")

# 연령이 디지털 정보화 수준에 어느정도 영향을 미치는지 선형회귀
par("mar")
par(mar=c(1,1,1,1))
install.packages("quantreg")
library(quantreg)
library(ggplot2)

digitAge.lm<-lm(디지털정보화수준~X.일반.장노년.연령, data=mmd)
summary(digitAge.lm)
plot(mmd$디지털정보화수준~mmd$X.일반.장노년.연령, ylab="디지털정보화수준",xlab="연령",  
             main="연령에 따른 디지털정보화수준",col="darkblue", type="n")
points(mmd$디지털정보화수준~mmd$X.일반.장노년.연령, cex=.5, col="blue")

abline(digitAge.lm, col="red", untf=TRUE, lty='solid')
abline(rq(mmd$디지털정보화수준~mmd$X.일반.장노년.연령, tau=.5), col="red")


ggplot(mmd, aes(x=X.일반.장노년.연령, y=디지털정보화수준))+geom_point(aes(colour=trt))

  # 회귀곡선
gg<-ggplot(data=mmd, aes(x=X.일반.장노년.연령, y=디지털정보화수준))+geom_point(aes(colour=AgeRe))+geom_smooth()
gg       



# 지역별(노년층의) 디지털정보화 수준의 차이 => ggmap 


Old<-subset(mmd, X.일반.장노년.연령>=55)
OldRegion$X.일반.장노년.현재.거주지역..광역시도. = factor(OldRegion$X.일반.장노년.현재.거주지역..광역시도.,
                                           labels=c('무응답','서울','부산','대구','인천','광주','대전','울산','세종','경기','강원','충북',
                                                    '충남','전북','전남','경북','경남','제주'))

ggplot(OldRegion, aes(x = X.일반.장노년.현재.거주지역..광역시도. , y = 디지털정보화수준)) +    #aes=x축/y축 설정하기
  geom_boxplot(outlier.colour="red") +
  ggtitle("지역별 노년층의 디지털 정보화 수준") +
  theme_classic() + # ggplot2 테마
  theme(title = element_text(color="darkblue", size=20))

m=table(OldRegion$X.일반.장노년.현재.거주지역..광역시도.)
plot(m)

# 비자발적 비이용자와 자발적 비이용자에서 가장 빈도수가 높은 비이용 이유
# 비자발적 비이용자

plot(table(mmd$AgeRe, mmd$문7..귀하께서는.최근.인터넷을.언제.이용하셨습니까.),
     xlab="연령", ylab="인터넷 이용 정도", main="연령에 따른 인터넷 이용 정도", color=TRUE)

# 비자발적 비이용자
barplot(table(mmd$문15.1...비자발적.비이용자.대상..그렇다면..현재.귀하께서.인터넷을.이용하지.못하고.계시는.가장.큰.이유는.무엇입니까..해당되는.것을.순서대로.선택해.주십시오..1순위))

table(mmd$문15.1...비자발적.비이용자.대상..그렇다면..현재.귀하께서.인터넷을.이용하지.못하고.계시는.가장.큰.이유는.무엇입니까..해당되는.것을.순서대로.선택해.주십시오..2순위)

# 자발적 비이용자
table(mmd$문15.2...자발적.비이용자.대상..그렇다면..현재.귀하께서.인터넷을.이용하지.않는.가장.큰.이유는.무엇입니까..해당되는.것을.순서대로.선택해.주십시오..1순위)
table(mmd$문15.2...자발적.비이용자.대상..그렇다면..현재.귀하께서.인터넷을.이용하지.않는.가장.큰.이유는.무엇입니까..해당되는.것을.순서대로.선택해.주십시오..2순위)


# 나이대별 정보화 교육 수요가 어떻게 다를까?=>교차분석/모자이크
table(mmd$AgeRe, mmd$문24...귀하에게.필요한.컴퓨터나.인터넷.이용.수준은.어떻게.되십니까..해당되는.것을.모두.골라주십시오.1)
mmd$AgeRe



Q25Age55<-subset(mmd, select = c(X.일반.장노년.연령, 문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.1,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.2,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.3,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.4,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.5,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.6,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.7,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.8,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.9,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.10,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.11,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.12,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.13,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.14,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.15,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.16,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.17,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.18,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.19,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.20,
                           문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.21), subset=mmd$X.일반.장노년.연령>=55)

write.csv(Q25Age55, file="Q25Age55.csv", row.names=TRUE)

# 문25번. 55세 이상만 뽑아내기.

x1=0
x2=0
x3=0
x4=0
x5=0
x6=0

for (j in 2:22){
  for (i in 1:2303){
    ifelse (Q25Age55[i,j]>=1&Q25Age55[i,j]<=5, x1<-x1+1,x1)
    ifelse (Q25Age55[i,j]>=6&Q25Age55[i,j]<=10, x2<-x2+1,x2)
    ifelse (Q25Age55[i,j]>=11&Q25Age55[i,j]<=13, x3<-x3+1,x3)
    ifelse (Q25Age55[i,j]>=14&Q25Age55[i,j]<=17, x4<-x4+1,x4)
    ifelse (Q25Age55[i,j]>=18&Q25Age55[i,j]<=20, x5<-x5+1,x5)
    ifelse (Q25Age55[i,j]>=21&Q25Age55[i,j]<=22, x6<-x6+1,x6)
  }}
print(x1)
print(x2)
print(x3)
print(x4)
print(x5)
print(x6)

Q25Old<-table(c('컴퓨터기초', '생활서비스','소셜미디어','미디어창작/앱개발 등','새로운기기, 기술 체험 및 활용법', '기타'),
      c(997, 1140, 425, 431, 144, 1102))
Q25Old
Q25Old<-data.frame('컴퓨터기초'=997,'생활서비스'=1140, '소셜미디어'=425,
                   '미디어창작/앱개발 등'=431, '새로운 기기, 기술 체험 및 활용법'=144, '기타'=1102)

barplot(Q25Old, xlab='IT교육', ylab='수요', main='55세 이상의 IT교육 수요')
plot(table(c('컴퓨터기초', '생활서비스','소셜미디어','미디어창작/앱개발 등','새로운기기, 기술 체험 및 활용법', '기타'),
           c(997, 1140, 425, 431, 144, 1102)))

# 55세 이상 성별별 25번 문항
# 남자 디지털수업 수요

mmdd1<-subset(mmd, select = c(X.일반.장노년.성별, 
                             X.일반.장노년.연령,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.1,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.2,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.3,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.4,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.5,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.6,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.7,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.8,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.9,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.10,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.11,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.12,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.13,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.14,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.15,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.16,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.17,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.18,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.19,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.20,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.21), subset=mmd$X.일반.장노년.성별==1&mmd$X.일반.장노년.연령>=55)


x1=0
x2=0
x3=0
x4=0
x5=0
x6=0

for (j in 2:22){
  for (i in 1:3557){
    ifelse (mmdd1[i,j]>=1&mmdd1[i,j]<=5, x1<-x1+1,x1)
    ifelse (mmdd1[i,j]>=6&mmdd1[i,j]<=10, x2<-x2+1,x2)
    ifelse (mmdd1[i,j]>=11&mmdd1[i,j]<=13, x3<-x3+1,x3)
    ifelse (mmdd1[i,j]>=14&mmdd1[i,j]<=17, x4<-x4+1,x4)
    ifelse (mmdd1[i,j]>=18&mmdd1[i,j]<=20, x5<-x5+1,x5)
    ifelse (mmdd1[i,j]>=21&mmdd1[i,j]<=22, x6<-x6+1,x6)
  }}
print(x1)
print(x2)
print(x3)
print(x4)
print(x5)
print(x6)

# 여자 디지털수업 수요

mmdd2<-subset(mmd, select = c(X.일반.장노년.성별, 
                             X.일반.장노년.연령,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.1,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.2,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.3,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.4,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.5,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.6,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.7,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.8,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.9,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.10,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.11,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.12,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.13,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.14,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.15,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.16,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.17,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.18,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.19,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.20,
                             문25..귀하께서.정부지원.정보화교육을.받을.기회가.있다면..다음.중.어떤.과정.강좌.를.수강하고.싶으신가요..해당되는.것을.모두.골라.주십시오.21), subset=mmd$X.일반.장노년.성별==2&mmd$X.일반.장노년.연령>=55)

x1=0
x2=0
x3=0
x4=0
x5=0
x6=0

for (j in 2:22){
  for (i in 1:3557){
    ifelse (mmdd2[i,j]>=1&mmdd2[i,j]<=5, x1<-x1+1,x1)
    ifelse (mmdd2[i,j]>=6&mmdd2[i,j]<=10, x2<-x2+1,x2)
    ifelse (mmdd2[i,j]>=11&mmdd2[i,j]<=13, x3<-x3+1,x3)
    ifelse (mmdd2[i,j]>=14&mmdd2[i,j]<=17, x4<-x4+1,x4)
    ifelse (mmdd2[i,j]>=18&mmdd2[i,j]<=20, x5<-x5+1,x5)
    ifelse (mmdd2[i,j]>=21&mmdd2[i,j]<=22, x6<-x6+1,x6)
  }}
print(x1)
print(x2)
print(x3)
print(x4)
print(x5)
print(x6)

# 위의 결과로 그래프 그리기 

v1=c('컴퓨터기초', '생활서비스','소셜미디어','미디어창작/앱개발 등','새로운기기, 기술 체험 및 활용법', '기타')
v2=c(400, 441, 152, 208, 81, 442)
v3=c(573, 688, 266, 210, 59, 635)
VAll<-data.frame(v1, v2, v3)
prop.table(VAll$v2, VAll$v3)
plot(VAll)



# 노년의 자발적, 비자발적 비이용자 비율

Age55<-subset(mmd, X.일반.장노년.연령>=55)
barplot(table(Age55$문15...인터넷.비이용자.문7의....응답자..대상..현재.귀하께서.인터넷을.이용하지.않는.이유는.어디에.해당되나요.))

# 노년층의 디지털기기 이용 목적

Q18one<-round(mean(Age55$문18...모든.응답자.대상..디지털기기.PC.또는.스마트폰.등..이용.동기와.관련하여.아래의.항목들에.대해.귀하께서는.어디에.해당되는지.응답해.주십시오..1..나는.디지털기기를.통해.많은.정보를.F1.2), 2)
Q18one

Q18two<-round(mean(Age55$문18...모든.응답자.대상..디지털기기.PC.또는.스마트폰.등..이용.동기와.관련하여.아래의.항목들에.대해.귀하께서는.어디에.해당되는지.응답해.주십시오..2..나는.디지털기기를.통해.많은.사람들.F1.2), 2)
Q18two

Q18three<-round(mean(Age55$문18...모든.응답자.대상..디지털기기.PC.또는.스마트폰.등..이용.동기와.관련하여.아래의.항목들에.대해.귀하께서는.어디에.해당되는지.응답해.주십시오..3..나는.디지털기기를.통해.재미있는.오.F1.2), 2)
Q18three

Q18four<-round(mean(Age55$문18...모든.응답자.대상..디지털기기.PC.또는.스마트폰.등..이용.동기와.관련하여.아래의.항목들에.대해.귀하께서는.어디에.해당되는지.응답해.주십시오..4..나는.디지털기기를.통해.자기.개발을.F1.2), 2)
Q18four

Q18five<-round(mean(Age55$문18...모든.응답자.대상..디지털기기.PC.또는.스마트폰.등..이용.동기와.관련하여.아래의.항목들에.대해.귀하께서는.어디에.해당되는지.응답해.주십시오..5..나는.디지털기기를.통해.다른.사람에.F1.2), 2)
Q18five

sum(is.na(Age55$문18...모든.응답자.대상..디지털기기.PC.또는.스마트폰.등..이용.동기와.관련하여.아래의.항목들에.대해.귀하께서는.어디에.해당되는지.응답해.주십시오..5..나는.디지털기기를.통해.다른.사람에.F1.2))


Q18<-data.frame(Q18one, Q18two, Q18three, Q18four, Q18five)
colnames(Q18)<-c("많은 정보 획득", "사교", "오락거리", "자기 개발", "내 의견 표현")
barplot(table(Q18$많은 정보 획득, Q18$사교, Q18$오락거리, Q18$자기 개발, Q18$내 의견 표현))

barplot(as.matrix(Q18),  main="디지털기기 이용 동기 (55세)",beside=T )


# 삶의 만족도에 대한 회귀분석
Age55$satisfy<-sum(Age55$문22...중학생.이상..모든.응답자.대상..귀하는.대체로.자신의.삶에.어느.정도.만족하시나요..1..대부분의.경우에서.내.삶은.내.이상과.가깝다
                 +Age55$문22...중학생.이상..모든.응답자.대상..귀하는.대체로.자신의.삶에.어느.정도.만족하시나요..2..내.삶의.조건들은.매우.우수하다
                 +Age55$문22...중학생.이상..모든.응답자.대상..귀하는.대체로.자신의.삶에.어느.정도.만족하시나요..3..나는.내.삶에.만족한다
                 +Age55$문22...중학생.이상..모든.응답자.대상..귀하는.대체로.자신의.삶에.어느.정도.만족하시나요..4..지금까지.나는.인생에서.내가.원하는.중요한.것들을.얻었다
                 +Age55$문22...중학생.이상..모든.응답자.대상..귀하는.대체로.자신의.삶에.어느.정도.만족하시나요..5..내.삶을.다시.산다면..나는.거의.아무것도.바꾸지.않을.것이다
                 )/5
sum(is.na(Age55$satisfy))

satisfy22.lm<-lm(satisfy~디지털정보화수준, data=Age55)
summary(satisfy22.lm)

Age55$satisfy21<-sum(Age55$문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_1
                     +Age55$문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_2
                     +Age55$문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_3
                     +Age55$문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_4
                     +Age55$문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_5
                     +Age55$문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_6
                     +Age55$문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_7
                     +Age55$문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_8
                     )/8
satisfy21.lm<-lm(satisfy21~디지털정보화수준, data=Age55)
summary(satisfy21.lm)
