getwd()
setwd("C:/Users/acorn/Desktop/R프로젝트")

md<-read.csv("mdis1.csv")
library(dplyr)
is.na(md$문8...검색.및.이메일..콘텐츠.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오.PC.기준..1..정보.및.뉴스.검색)
internetYesQ7<-subset(md, 문7..귀하께서는.최근.인터넷을.언제.이용하셨습니까.==1)

### 디지털정보화 활용 수준 ###
mode(md$문7..귀하께서는.최근.인터넷을.언제.이용하셨습니까.)


####### 활용수준가중치 ########

### 유선 및 모바일 인터넷 이용여부(0.4)

md$Q7IntYes[md$문7..귀하께서는.최근.인터넷을.언제.이용하셨습니까.==1]<-0.4
md$Q7IntYes[md$문7..귀하께서는.최근.인터넷을.언제.이용하셨습니까.==2]<-0
md$Q7IntYes[md$문7..귀하께서는.최근.인터넷을.언제.이용하셨습니까.==3]<-0

### 인터넷 서비스 이용 다양성(0.4)

## Q8 ##
md$Q8PCmean<-(md$문8...검색.및.이메일..콘텐츠.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오.PC.기준..1..정보.및.뉴스.검색
            +md$문8...검색.및.이메일..콘텐츠.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오.PC.기준..2..이메일
            +md$문8...검색.및.이메일..콘텐츠.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오.PC.기준..3..미디어콘텐츠.영화.음악.전자책.등.
            +md$문8...검색.및.이메일..콘텐츠.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오.PC.기준..4..교육콘텐츠.각종.강좌.강의수강.등.
            )/4
md$Q8PHmean<-(md$문8...검색.및.이메일..콘텐츠.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오.모바일기기.기준..1..정보.및.뉴스.검색
            +md$문8...검색.및.이메일..콘텐츠.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오.모바일기기.기준..2..이메일
            +md$문8...검색.및.이메일..콘텐츠.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오.모바일기기.기준..3..미디어콘텐츠.영화.음악..F1.2
            +md$문8...검색.및.이메일..콘텐츠.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오.모바일기기.기준..4..교육콘텐츠.각종.강좌.강.F1.2
            )/4


table(is.na(md$Q8PCmean))
table(is.na(md$Q8PHmean))

## Q9 ##

md$Q9PCmean<-(md$문9...사회관계.및.정보공유.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..PC.기준.1..SNS
              +md$문9...사회관계.및.정보공유.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..PC.기준.2..메신저
              +md$문9...사회관계.및.정보공유.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..PC.기준.3..개인.블로그
              +md$문9...사회관계.및.정보공유.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..PC.기준.4..커뮤니티
              +md$문9...사회관계.및.정보공유.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..PC.기준.5..클라우드.서비스
              )/5
md$Q9PHmean<-(md$문9...사회관계.및.정보공유.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..모바일기기.기준.1..SNS
              +md$문9...사회관계.및.정보공유.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..모바일기기.기준.2..메신저
              +md$문9...사회관계.및.정보공유.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..모바일기기.기준.3..개인.블로그
              +md$문9...사회관계.및.정보공유.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..모바일기기.기준.4..커뮤니티
              +md$문9...사회관계.및.정보공유.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..모바일기기.기준.5..클라우드.서비스
              )/5

## Q10 ##

md$Q10PCmean<-(md$문10...생활.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..PC.기준.1..교통정보.및.지도
               +md$문10...생활.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..PC.기준.2..제품구매.쇼핑..및.예약.예매
               +md$문10...생활.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..PC.기준.3..금융거래.인터넷뱅킹..계좌.확인.이체.송금..증권거래F1.2
               +md$문10...생활.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..PC.기준.4..행정.전자정부..서비스
               +md$문10...생활.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..PC.기준.5..생활.복지.서비스
               )/5
md$Q10PHmean<-(md$문10...생활.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..모바일기기.기준.1..교통정보.및.지도
               +md$문10...생활.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..모바일기기.기준.2..제품구매.쇼핑..및.예약.예매
               +md$문10...생활.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..모바일기기.기준.3..금융거래.인터넷뱅킹..계좌.확인.이체.송금.F1.2
               +md$문10...생활.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..모바일기기.기준.4..행정.전자정부..서비스
               +md$문10...생활.서비스..귀하께서는.최근.1년.동안.다음과.같은.서비스를.얼마나.이용하셨습니까..모든.항목에.대해.응답해.주십시오..모바일기기.기준.5..생활.복지.서비스
               )/5

md$Wei2<-(md$Q8PCmean+md$Q8PHmean+md$Q9PCmean+md$Q9PHmean+md$Q10PCmean+md$Q10PHmean)/6*0.16

## 인터넷 심화 활용정도 ## (0.2)
## Q11 ##
md$Q11PCmean<-(md$문11...정보생산.공유정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.1..직접.만들거나.다른.사람이.만든.것을.수정.편집한.콘텐츠.정보.F1.2
               +md$문11...정보생산.공유정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.2..인터넷에서.본.콘텐츠.정보.지식.뉴스.동영상.사진.등.를.올리거F1.2
                )/2
md$Q11PHmean<-(md$문11...정보생산.공유정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.1..직접.만들거나.다른.사람이.만든.것을.수정.편집한.콘.F1.2
               +md$문11...정보생산.공유정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.2..인터넷에서.본.콘텐츠.정보.지식.뉴스.동영상.사진.등.F1.2
                )/2

## Q12 ##
md$Q12PCmean<-(md$문12...네트워킹.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.1..나는.기존에.알던.사람들과.관계를.유지하고.더.친밀해지기.위해서..F1.2
               +md$문12...네트워킹.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.2..나는.새로운.사람들을.알게.되고.소통하기.위해.인터넷을.이용한.적.F1.2
               )/2
md$Q12PHmean<-(md$문12...네트워킹.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.1..나는.기존에.알던.사람들과.관계를.유지하고.더.친밀해지.F1.2
               +md$문12...네트워킹.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.2..나는.새로운.사람들을.알게.되고.소통하기.위해.인터넷을..F1.2
               )/2
## Q13 ##
md$Q13PCmean<-(md$문13...사회참여.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.1..나는.인터넷을.통해.사회적.관심사.공공이슈.에.대해.의견.표명을.한F1.2
               +md$문13...사회참여.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.2..나는.인터넷을.통해.정부.지자체.공공기관에.정책제안이나.건의..정.F1.2
               +md$문13...사회참여.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.3..나는.인터넷을.통해.기부.금전.재능.나.봉사.활동을.한.적이.있다
               +md$문13...사회참여.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.4..나는.인터넷을.통해.온라인.투표나.여론조사..서명.등에.참여한.적이F1.2
               )/4
md$Q13PHmean<-(md$문13...사회참여.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.1..나는.인터넷을.통해.사회적.관심사.공공이슈.에.대해.의견.F1.2
               +md$문13...사회참여.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.2..나는.인터넷을.통해.정부.지자체.공공기관에.정책제안이나F1.2
               +md$문13...사회참여.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.3..나는.인터넷을.통해.기부.금전.재능.나.봉사.활동을.한.적.F1.2
               +md$문13...사회참여.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.4..나는.인터넷을.통해.온라인.투표나.여론조사..서명.등에.참F1.2
               )/4
## Q14 ##
md$Q14PCmean<-(md$문14...경제활동.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.1..나는.인터넷을.통해.취업이나.이직.승진.에.도움이.되는.활동을.한..F1.2
               +md$문14...경제활동.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.2..나는.인터넷을.통해.창업이나.사업에.도움이.되는.마케팅.활동.홍보.F1.2
               +md$문14...경제활동.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.3..나는.인터넷을.통해.소득증대.유지.에.도움이.되는.관련.정보검색.습F1.2
               +md$문14...경제활동.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..PC.기준.4..나는.인터넷을.통해.비용절감에.도움이.되는.활동.공동구매..해외직.F1.2
               )/4
md$Q14PHmean<-(md$문14...경제활동.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.1..나는.인터넷을.통해.취업이나.이직.승진.에.도움이.되는.활F1.2
               +md$문14...경제활동.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.2..나는.인터넷을.통해.창업이나.사업에.도움이.되는.마케팅..F1.2
               +md$문14...경제활동.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.3..나는.인터넷을.통해.소득증대.유지.에.도움이.되는.관련.정F1.2
               +md$문14...경제활동.정도..최근.1년간.디지털기기.PC.또는.스마트폰.등.를.통해.다음과.같은.활동을.얼마나.하셨는지요..모바일기기.기준.4..나는.인터넷을.통해.비용절감에.도움이.되는.활동.공동구.F1.2
               )/4
md$Wei3<-(md$Q11PCmean+md$Q11PHmean+md$Q12PCmean+md$Q12PHmean+md$Q13PCmean+md$Q13PHmean+md$Q14PCmean+md$Q14PHmean)/8*0.08

md$UsageWei<-(md$Q7IntYes+md$Wei2+md$Wei3)


######### 접근성 가중치 #########
md$Q1ComYes[md$문1..현재.귀하가.이용할.수.있는.데스크탑.컴퓨터나.노트북이.귀댁에.있습니까..1..데스크탑.컴퓨터==1]<-1
md$Q1ComYes[md$문1..현재.귀하가.이용할.수.있는.데스크탑.컴퓨터나.노트북이.귀댁에.있습니까..1..데스크탑.컴퓨터==2]<-0

md$Q1LabYes[md$문1..현재.귀하가.이용할.수.있는.데스크탑.컴퓨터나.노트북이.귀댁에.있습니까..2..노트북==1]<-1
md$Q1LabYes[md$문1..현재.귀하가.이용할.수.있는.데스크탑.컴퓨터나.노트북이.귀댁에.있습니까..2..노트북==2]<-0

md$Q2PhYes[md$문2...보기.카드.제시..다음.제시한.기기별로.귀댁에서.귀하가.이용할.수.있는.기기의.보유여부를.응답해주세요.1..휴대폰.모두.응답..1==1]<-1
md$Q2PhYes[md$문2...보기.카드.제시..다음.제시한.기기별로.귀댁에서.귀하가.이용할.수.있는.기기의.보유여부를.응답해주세요.1..휴대폰.모두.응답..1==2]<-0
md$Q2PhYes[md$문2...보기.카드.제시..다음.제시한.기기별로.귀댁에서.귀하가.이용할.수.있는.기기의.보유여부를.응답해주세요.1..휴대폰.모두.응답..1==3]<-0

md$Q2PadYes[md$문2...보기.카드.제시..다음.제시한.기기별로.귀댁에서.귀하가.이용할.수.있는.기기의.보유여부를.응답해주세요.2..스마트패드.태블릿.PC..아이패드..갤럭시탭.노트...LG.G패드..넥서스7.등.==1]<-1
md$Q2PadYes[md$문2...보기.카드.제시..다음.제시한.기기별로.귀댁에서.귀하가.이용할.수.있는.기기의.보유여부를.응답해주세요.2..스마트패드.태블릿.PC..아이패드..갤럭시탭.노트...LG.G패드..넥서스7.등.==2]<-0

md$Q2WeaYes[md$문2...보기.카드.제시..다음.제시한.기기별로.귀댁에서.귀하가.이용할.수.있는.기기의.보유여부를.응답해주세요.3..스마트.주변기기.스마트워치..스마트헬스밴드.등.==1]<-1
md$Q2WeaYes[md$문2...보기.카드.제시..다음.제시한.기기별로.귀댁에서.귀하가.이용할.수.있는.기기의.보유여부를.응답해주세요.3..스마트.주변기기.스마트워치..스마트헬스밴드.등.==2]<-0

md$유무선보유여부<-(md$Q1ComYes+md$Q1LabYes+md$Q2PhYes+md$Q2PadYes+md$Q2WeaYes)/5*0.1


md$Q3HomeIntYes[md$문3..현재.귀댁에서는.컴퓨터.노트북..스마트폰.스마트패드..TV..게임기.등을.통해.인터넷.무선인터넷.포함.을.이용.할.수.있습니까.==1]<-1
md$Q3HomeIntYes[md$문3..현재.귀댁에서는.컴퓨터.노트북..스마트폰.스마트패드..TV..게임기.등을.통해.인터넷.무선인터넷.포함.을.이용.할.수.있습니까.==2]<-0

md$인터넷접속가능<-md$Q3HomeIntYes*0.1

md$접근수준<-md$유무선보유+md$인터넷접속가능

######### 역량수준 가중치 ###########
md$Q4mean<-(md$문4..귀하는.컴퓨터.데스크탑.노트북.를.통해.다음의.활동을.스스로.얼마나.하실.수.있으신지요..1..나는.필요한.프로그램.소프트웨어.을.컴퓨터에.설치.삭제.업데이트.할.수.있다
            +md$문4..귀하는.컴퓨터.데스크탑.노트북.를.통해.다음의.활동을.스스로.얼마나.하실.수.있으신지요..2..나는.컴퓨터에.유선.또는.무선.인터넷을.스스로.연결해서.사용할.수.있다
            +md$문4..귀하는.컴퓨터.데스크탑.노트북.를.통해.다음의.활동을.스스로.얼마나.하실.수.있으신지요..3..나는.웹.브라우저.익스플로러..크롬..사파리.등.에서.내가.원하는.환경을.설정할.수.있다..팝업F1.2
            +md$문4..귀하는.컴퓨터.데스크탑.노트북.를.통해.다음의.활동을.스스로.얼마나.하실.수.있으신지요..4..나는.컴퓨터에.다양한.외장기기.디지털.카메라..프린터..스캐너..USB.외장하드.등.를.연결하여..F1.2
            +md$문4..귀하는.컴퓨터.데스크탑.노트북.를.통해.다음의.활동을.스스로.얼마나.하실.수.있으신지요..5..나는.컴퓨터에.있는.파일을.인터넷을.통해.다른.사람에게.전송할.수.있다
            +md$문4..귀하는.컴퓨터.데스크탑.노트북.를.통해.다음의.활동을.스스로.얼마나.하실.수.있으신지요..6..나는.컴퓨터의.악성코드.바이러스..스파이웨어.등.를.검사.치료할.수.있다
            +md$문4..귀하는.컴퓨터.데스크탑.노트북.를.통해.다음의.활동을.스스로.얼마나.하실.수.있으신지요..7..나는.컴퓨터.한글..엑셀..파워포인트.등.를.이용하여.문서나.자료를.작성할.수.있다
            )/7

md$Q5mean<-(md$문5..귀하는.모바일기기.스마트폰.및.스마트패드.등.를.통해.다음의.활동을.스스로.얼마나.하실.수.있습니까..1..나는.모바일기기에서.디스플레이.소리.보안.알람.입력방법.등의.환경설정을.할..F1.2
            +md$문5..귀하는.모바일기기.스마트폰.및.스마트패드.등.를.통해.다음의.활동을.스스로.얼마나.하실.수.있습니까..2..나는.모바일기기에서.무선.네트워크.와이파이..설정을.할.수.있다
            +md$문5..귀하는.모바일기기.스마트폰.및.스마트패드.등.를.통해.다음의.활동을.스스로.얼마나.하실.수.있습니까..3..나는.모바일기기에.있는.파일을.컴퓨터로.옮길.수.있다
            +md$문5..귀하는.모바일기기.스마트폰.및.스마트패드.등.를.통해.다음의.활동을.스스로.얼마나.하실.수.있습니까..4..나는.내.모바일기기에.있는.파일.사진.등을.다른.사람에게.전송할.수.있다
            +md$문5..귀하는.모바일기기.스마트폰.및.스마트패드.등.를.통해.다음의.활동을.스스로.얼마나.하실.수.있습니까..5..나는.필요한.앱을.모바일기기에.설치.삭제.업데이트할.수.있다
            +md$문5..귀하는.모바일기기.스마트폰.및.스마트패드.등.를.통해.다음의.활동을.스스로.얼마나.하실.수.있습니까..6..나는.모바일기기의.악성코드.바이러스..스파이웨어.등.를.검사.치료할.수.있다
            +md$문5..귀하는.모바일기기.스마트폰.및.스마트패드.등.를.통해.다음의.활동을.스스로.얼마나.하실.수.있습니까..7..나는.모바일기기에서.문서나.자료.메모..워드.등.를.작성할.수.있다
            )/7

md$역량수준<-(md$Q4mean+md$Q5mean)/2*0.2


########## 디지털정보화 수준 ############
md$디지털정보화수준<-md$역량수준+md$접근수준+md$UsageWei
table(is.na(md$디지털정보화수준))
write.csv(md, file="modifiedMd2.csv", row.names=TRUE)


