setwd('E:/R프로젝트')
mmd<-read.csv("modifiedMd2.csv")

# 일상 생활 부문별 각각의 만족도에 디지털정보화지수가 미치는 영향 #
# 회귀분석 #
Q21_1.glm<-glm(문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_1
                       ~ 디지털정보화수준, data=mmd)
summary(Q21_1.glm)

Q21_2.glm<-glm(문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_2
                       ~ 디지털정보화수준, data=mmd)
summary(Q21_2.glm)

Q21_3.glm<-glm(문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_3
                ~ 디지털정보화수준, data=mmd)
summary(Q21_3.glm)

Q21_4.glm<-glm(문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_4
                ~ 디지털정보화수준, data=mmd)
summary(Q21_4.glm)

Q21_5.glm<-glm(문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_5
                ~ 디지털정보화수준, data=mmd)
summary(Q21_5.glm)

Q21_6.glm<-glm(문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_6
                ~ 디지털정보화수준, data=mmd)
summary(Q21_6.glm)

Q21_7.glm<-glm(문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_7
                ~ 디지털정보화수준, data=mmd)
summary(Q21_7.glm)

Q21_8.glm<-glm(문21...중학생.이상..모든.응답자.대상..다음은.일상생활.부문별.만족도에.대한.질문입니다..스마트폰.이용여부와.관계없이.귀하께서는.일상생활에서.아래의.항목들에.대해.얼마나.만족하십니까F1.2_8
                ~ 디지털정보화수준, data=mmd)
summary(Q21_8.glm)


# 삶의 만족도에 영향일 미치는 다양한 요인 #

mmd$satisfy<-sum(mmd$문22...중학생.이상..모든.응답자.대상..귀하는.대체로.자신의.삶에.어느.정도.만족하시나요..1..대부분의.경우에서.내.삶은.내.이상과.가깝다
                   +mmd$문22...중학생.이상..모든.응답자.대상..귀하는.대체로.자신의.삶에.어느.정도.만족하시나요..2..내.삶의.조건들은.매우.우수하다
                   +mmd$문22...중학생.이상..모든.응답자.대상..귀하는.대체로.자신의.삶에.어느.정도.만족하시나요..3..나는.내.삶에.만족한다
                   +mmd$문22...중학생.이상..모든.응답자.대상..귀하는.대체로.자신의.삶에.어느.정도.만족하시나요..4..지금까지.나는.인생에서.내가.원하는.중요한.것들을.얻었다
                   +mmd$문22...중학생.이상..모든.응답자.대상..귀하는.대체로.자신의.삶에.어느.정도.만족하시나요..5..내.삶을.다시.산다면..나는.거의.아무것도.바꾸지.않을.것이다
                )/5
sum(is.na(mmd$satisfy))

satisfy22.lm<-lm(satisfy~디지털정보화수준+X.일반.장노년.연령+X.일반.장노년.가구.월평균.소득, data=mmd)
summary(satisfy22.lm)

satisfy1.lm<-lm(satisfy~디지털정보화수준, data=mmd)
summary(satisfy1.lm)


satisfyCor<-data.frame(mmd$satisfy, mmd$디지털정보화수준, mmd$X.일반.장노년.연령)
satisfyCor<-na.omit(satisfyCor)

table(is.na(satisfyCor))
satisfyCor<-cor(satisfyCor)
satisfyCor
